projects/writing/anime/2022_spring_pre/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-20 Thu 16:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Eric" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3faf65c">1. Spring 2022 Previews</a>
<ul>
<li><a href="#orgf7aa4d4">1.1. OP</a></li>
<li><a href="#orge57fac5">1.2. With a smooth, almost liquid appearance, glassy rocks have no distinctive crystallization and are easy for me to decide to watch.</a>
<ul>
<li><a href="#org5d0ff03">1.2.1. Komi-san wa, Comyushou desu. 2nd Season</a></li>
</ul>
</li>
<li><a href="#orga4905e5">1.3. With mineral grants large enough to be seen with the unaided eye, phaneritic rocks have some distinguishable merits even before they (are thrown in the) air.</a>
<ul>
<li><a href="#org4344613">1.3.1. Dance Dancce Danseur</a></li>
<li><a href="#orgf32980d">1.3.2. Ao Ashi</a></li>
<li><a href="#org5f847e8">1.3.3. Spy x Family</a></li>
<li><a href="#orgf4a3c38">1.3.4. Summertime Render</a></li>
</ul>
</li>
<li><a href="#org2ca16a4">1.4. With conspicuous phenocrysts in a fine-grained groundmass, porphyritic rocks are not as phanerish as phaneritic rocks, but they might have a cute crystal or two.</a>
<ul>
<li><a href="#org1b0faeb">1.4.1. Paripi Koumei</a></li>
<li><a href="#orgafc1dc7">1.4.2. Aharen-san wa Hakarenai</a></li>
<li><a href="#org1e2a02d">1.4.3. Kawaii dake ja Nai Shikimori-san</a></li>
<li><a href="#orgb05ec30">1.4.4. ONIPAN!</a></li>
</ul>
</li>
<li><a href="#orgbfd5342">1.5. With different compositions that are indistinguishable from each other by the unaided eye, aphanitic rocks are for plebs.</a>
<ul>
<li><a href="#orga284115">1.5.1. Love All Play</a></li>
<li><a href="#orgbddc6f4">1.5.2. Gunjou no Fanfare</a></li>
<li><a href="#orgf1d284a">1.5.3. Tomodachi Game and Deaimon</a></li>
</ul>
</li>
<li><a href="#org016be15">1.6. ED</a></li>
<li><a href="#org342a429">1.7. Follow-up</a>
<ul>
<li><a href="#org2ea9f65">1.7.1. Re: Aharen-san</a></li>
<li><a href="#org6393f29">1.7.2. Re: "Eye asses"</a></li>
<li><a href="#org28561b9">1.7.3. Re: Leading me wrong before</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org3faf65c" class="outline-2">
<h2 id="org3faf65c"><span class="section-number-2">1</span> Spring 2022 Previews</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf7aa4d4" class="outline-3">
<h3 id="orgf7aa4d4"><span class="section-number-3">1.1</span> OP</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Eyo,
</p>

<p>
New season, as our eyes notice buds on previously bare branches, so do our nostrils detect the scent of new anime. Switching tracks, this time I'm categorizing my anime thoughts by igneous rock textures.
</p>
</div>
</div>

<div id="outline-container-orge57fac5" class="outline-3">
<h3 id="orge57fac5"><span class="section-number-3">1.2</span> With a smooth, almost liquid appearance, glassy rocks have no distinctive crystallization and are easy for me to decide to watch.</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org5d0ff03" class="outline-4">
<h4 id="org5d0ff03"><span class="section-number-4">1.2.1</span> Komi-san wa, Comyushou desu. 2nd Season</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Not much to say, I liked the last season and still haven't read the manga, so I'll probably enjoy this season.
</p>
</div>
</div>
</div>

<div id="outline-container-orga4905e5" class="outline-3">
<h3 id="orga4905e5"><span class="section-number-3">1.3</span> With mineral grants large enough to be seen with the unaided eye, phaneritic rocks have some distinguishable merits even before they (are thrown in the) air.</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org4344613" class="outline-4">
<h4 id="org4344613"><span class="section-number-4">1.3.1</span> Dance Dancce Danseur</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
I like the manga so I don't feel an obligation to watch this for the story. If it fails to improve on at least some aspect of the work, I'll drop it. If I'm not misremembering the pacing of the manga, the anime might have to move things around or cut portions to end at what I would consider a "satisfying" place in one season (but not sure it'll just be one yet). That could be a good thing or not, as portions of the manga drag. There are two chief animation directors, who each seem fine, which may or may not be a bad sign for the animation quality, not sure.
</p>
</div>
</div>

<div id="outline-container-orgf32980d" class="outline-4">
<h4 id="orgf32980d"><span class="section-number-4">1.3.2</span> Ao Ashi</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Ao Ashi is one of my favorite three recent soccer manga (along with Days and Be Blues), but I was somewhat surprised it was being animated at all, and by Production I.G. even more so. The character designs in the early parts of the manga can be both very loose (in the sense that they fluctuate between chapters) and angular. The show definitely standardized them in the trailers, which is totally understandable, but a tiny bit disappointing.
</p>

<p>
I'm in for the chance that there are some Haikyuu-esque animation sequences, which I think Ao Ashi lends itself to (since the manga at least makes use of the loose character designs to have some very expressive soccer and character moments).
</p>

<p>
The director (Akira Satou) hasn't helmed a show I recognize yet, but has been around for a while. Some of the key folks (the director, one of the character designers, director of photography) don't seem to have worked for a couple years, which I'm choosing to take as a sign that this show will have zero production issues.
</p>
</div>
</div>

<div id="outline-container-org5f847e8" class="outline-4">
<h4 id="org5f847e8"><span class="section-number-4">1.3.3</span> Spy x Family</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
Yay, another good manga is being adapted (probably) well. The voice actors for Loid and Yor are "cool"-er than I had in my head, and Anya is more child-like (guess they decided that children should have children's voices, instead  of the higher-pitched aging comedian I'd imagined).
</p>
</div>
</div>

<div id="outline-container-orgf4a3c38" class="outline-4">
<h4 id="orgf4a3c38"><span class="section-number-4">1.3.4</span> Summertime Render</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
The manga is on my list of series to get to, but the anime trailers look good, so guess I'll start with this.
</p>

<p>
The director (Watanabe Ayumu) has a fairly long track record (lots of Doraemon movies that I have no knowledge of), but specifically directed Kaijuu no Kodomo which was a very beautiful movie that was sea-themed. And the main background artist (Kusanagi) worked on nice stuff like Kakushigoto, Ride Your Wave, and Super Cub (which had really nice backgrounds).
</p>
</div>
</div>
</div>

<div id="outline-container-org2ca16a4" class="outline-3">
<h3 id="org2ca16a4"><span class="section-number-3">1.4</span> With conspicuous phenocrysts in a fine-grained groundmass, porphyritic rocks are not as phanerish as phaneritic rocks, but they might have a cute crystal or two.</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org1b0faeb" class="outline-4">
<h4 id="org1b0faeb"><span class="section-number-4">1.4.1</span> Paripi Koumei</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
There's very little animation in some of the promos, but the character animation shown is consistent and it looks like a fun enough premise that the animation doesn't matter much. Not sure if this will be as silly as Zombieland Saga, but could still be good. Looks like it's the director's (Honma Osamu) first full series after working on a bunch of stuff I'm not familiar with as an episode director and producer (so not coming from an animation background, which probably matters less for a comedy series). Oddly, the same art director (Higashi Junichi) as Cowboy Bebop. except it's not that strange because he's done a bunch of bad-to-good things apart from that.
</p>
</div>
</div>

<div id="outline-container-orgafc1dc7" class="outline-4">
<h4 id="orgafc1dc7"><span class="section-number-4">1.4.2</span> Aharen-san wa Hakarenai</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
Looks like pure fluff. So very well might watch it. Plus, one of the directors (Makino Tomoe) directed Kotarou Lives Alone. I don't expect the same level of bitter-bitter-sweet as Kotarou, but just the sweet would be enough to watch.
</p>
</div>
</div>

<div id="outline-container-org1e2a02d" class="outline-4">
<h4 id="org1e2a02d"><span class="section-number-4">1.4.3</span> Kawaii dake ja Nai Shikimori-san</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
I also like this manga, but don't feel a strong compulsion to watch this show (with it's anime-ification of the character designs serving as one turn off).
</p>
</div>
</div>

<div id="outline-container-orgb05ec30" class="outline-4">
<h4 id="orgb05ec30"><span class="section-number-4">1.4.4</span> ONIPAN!</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
Not sure what this is about (except for onis and underwear), but it's short so I'll try it.
</p>
</div>
</div>
</div>

<div id="outline-container-orgbfd5342" class="outline-3">
<h3 id="orgbfd5342"><span class="section-number-3">1.5</span> With different compositions that are indistinguishable from each other by the unaided eye, aphanitic rocks are for plebs.</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-orga284115" class="outline-4">
<h4 id="orga284115"><span class="section-number-4">1.5.1</span> Love All Play</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
After watching Ryman's Club this winter, Love All Play looks likely to also fail to animate badminton well. But without the more unique premise of adults doing sports, I have no interest in this.
</p>

<p>
The director (Takeuchi Hiroshi) has worked on a mix of great stuff (Mob Psycho 100 II, Cowboy Bebop) and meh stuff, but mostly as an animator/storyboarder. The two series they've directed fall squarely into the meh category for me. Also a bit odd that three people are credited for the script (I like work that all of them have done) along with an original creator. Not sure if that is unusual, but can't remember seeing another series like that recently.
</p>
</div>
</div>

<div id="outline-container-orgbddc6f4" class="outline-4">
<h4 id="orgbddc6f4"><span class="section-number-4">1.5.2</span> Gunjou no Fanfare</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
The only way I would watch this horse boy anime is if it had a stinging critique of class structure (or turned into an isekai where the boys had to chariot race for their lives). So, let's watch the trailer&#x2026; Hm, "If something's bothering you, want me to make you feel better?" "They say you have to become one with your horse!" "Is this the price I paid for quitting being an idol?" The newest horse idol show isn't what I'm looking for. Plus, the horse animation looks silly.
</p>
</div>
</div>

<div id="outline-container-orgf1d284a" class="outline-4">
<h4 id="orgf1d284a"><span class="section-number-4">1.5.3</span> Tomodachi Game and Deaimon</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
Rather read the manga if anything.
</p>
</div>
</div>
</div>

<div id="outline-container-org016be15" class="outline-3">
<h3 id="org016be15"><span class="section-number-3">1.6</span> ED</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Oye,
</p>

<p>
Eric
</p>
</div>
</div>
<div id="outline-container-org342a429" class="outline-3">
<h3 id="org342a429"><span class="section-number-3">1.7</span> Follow-up</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-org2ea9f65" class="outline-4">
<h4 id="org2ea9f65"><span class="section-number-4">1.7.1</span> Re: Aharen-san</h4>
<div class="outline-text-4" id="text-1-7-1">
<p>
No way this is loli-bait. I'll have you know that the main girl only gets in between the main guy's legs once in the first episode!
</p>
</div>
</div>

<div id="outline-container-org6393f29" class="outline-4">
<h4 id="org6393f29"><span class="section-number-4">1.7.2</span> Re: "Eye asses"</h4>
<div class="outline-text-4" id="text-1-7-2">
<p>
I found this hard to imagine, but I'll keep trying. Is the pupil the asshole, because of the illusion of depth? Or is the optic nerve coming out of the ass? Or is the eye socket itself the ass and the eye is the "butt" plug?
</p>
</div>
</div>

<div id="outline-container-org28561b9" class="outline-4">
<h4 id="org28561b9"><span class="section-number-4">1.7.3</span> Re: Leading me wrong before</h4>
<div class="outline-text-4" id="text-1-7-3">
<p>
I can't remember you leading me wrong before. And you know the old saying, "You can lead a horse to water, but you can't make them watch shows they don't want to." By which I mean I take responsibility for choosing to consume my fair share of watered-down anime.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Eric</p>
<p class="date">Created: 2023-04-20 Thu 16:23</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
